최종 사용자 라이선스 동의서(EULA)



누구라도 본 라이선스를 원문 그대로 복제하고 배포할 수 있다. 그러나 본문에 대한 수정은 허용되지 않는다.



서문

TRS EUAL LICENSE 는 모든 버전을 공유하고 수정 할 수 있는 비상업적 자유를 보상 하며
개발자의 저작물 상업권에 대한 권리를 보장하기 위한 것으로 제작되었다.

저작권저작물을 사용하기 위해서는 저작재산권자의 사용허락을 받아야 하며
TRS EUAL LICENSE 의 경우 저작권자의 허락을 받지 않는 활동으로 간주하여
저작물 사용을 포기 해야 할 수도 있다.

정의

TRS EULA LICENSE 가 적용 되어있는 저작물은 라이센스에 의해 보호 되며, 라이센스를 어길 시
형사 처벌에 처할 수도 있다.

본 라이센스는 다음 같은 효력을 가진다.

제 1조, 재배포를 허용한다. 다만 다른 조항을 어기지 않는다면 배포 및 재배포가 가능하며, 수정 후 배포 역시 가능하다.

제 2조, 코드공개의 강제성, 이 라이센스가 적용 된 저작물을 사용 한 서버는 저작물의 사용유무를 반드시 유저가 알 수 있어야 하고, 저작물의 소스를
다른 유저가 받을 수 있도록 해야 한다.

제 3조, 변경 된 소스공개의 강제성, 이 라이센스가 적용 된 저작물을 사용 한 서버는 저작물 코드를 변경해서 쓰고 있다고 하더라도 수정된 저작물의 코드를 
다른 유저가 받을 수 있게 해야 한다.

제 4조, 소프트웨어의 사용권 동의서 첨부의무, TRS EULA LICENSE 가 적용된 저작물은 배포 시엔 LICENCE.md 파일을 반드시 첨부 해야 한다.

제 5조, 소프투웨어의 법적 보호성, 해당 라이센스가 적용 된 저작물들은 저작권 및 특허권에 의해 보호 받는다.

제 6조, 무단상업적 사용의 금지, 사전에 저작권자를 통해 허용되지 않는 행동을 한 모든 상업적 사용을 금지 한다. 이것은
재배포 시나 수정 시에도 유효하며, 상업적 사용의 범주는 아래 호에서 다룬다.

제 7조, 2차/3차 저작물에 대한 권리, 재배포 되어진 저작물과 수정된 저작물 역시 1차 저작권자에게 권리가 주어진다.
2차/3차 개발자의 권리는 1차저작권자 에게 주어진다. 따라서 2차/3차 저작물이 저작권 저작권침해를 당한경우, 1차저작권자가 2차
3차 저작물에 대해서도 권리 침해를 주장 할 수 있다.

상업적 사용의 범주

프로그램을 상업적으로 전달하거나 전달 받는 모든 행위

프로그램을 이용해서 어떠한 상업적인 이득을 얻는 모든 행위

프로그램의 코드를 싱업적으로 쓰이거나 쓰일 프로그램에 첨부하는 행위

라이센스 위반에 대한 경고

만약 프로그램에 라이센스를 위반하는 행위가 있을 경우 저작권자는 이를 중단 요청을 할 수 있고, 이 라이센스를 직접 적으로 지키지 않거나
간접적으로 지키지 않으려 하는 경우 지적재산권 침해행위 혹은 지적재산권 침해 방조책임을 민형사 적으로 지게될 수 있다.



